taurus_jmeter_script6.yml
---
execution:
- concurrency: 5
  hold-for: 1m
  ramp-up: 20s
  scenario: Thread Group
scenarios:
  Thread Group:
    requests:
    - label: blazedemo
      method: GET
      url: http://blazedemo.com/
    - body:
        fromPort: Paris
        toPort: Buenos Aires
      label: reserve
      method: POST
      url: http://blazedemo.com/reserve.php
reporting:
- module: final_stats
  summary: true  
  percentiles: true 
  failed-labels: false  
  test-duration: true  
  dump-xml: report.xml
  dump-csv: report.csv